stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_PBP_Source_Multilanguage/STM32_WPAN/App/pbp_app.c
  LOG_INFO_APP(">>==  End CAP Initiator initialization\n");
  return ret;
}

/**
  * @brief   Start PBP Source
  */
uint8_t PBPAPP_StartSource(void)
{
  uint8_t ret;
  uint8_t a_additional_adv_data[COMPLETE_LOCAL_NAME_LENGTH + 2 + MANUFACTURER_DATA_LENGTH + 1] = \
                                                                                    {COMPLETE_LOCAL_NAME_LENGTH + 1,
                                                                                    AD_TYPE_COMPLETE_LOCAL_NAME};
  PBP_PBS_BroadcastAudioStart_Params_t pbp_audio_start_params;
  CAP_Broadcast_AudioStart_Params_t cap_audio_start_params;
  char broadcast_name_string[BROADCAST_NAME_LENGTH+1];
  char language_string[10];
  char source_id_string[COMPLETE_LOCAL_NAME_LENGTH+1];

  uint8_t Pb_Addr_Len;
  uint8_t Pb_Addr[6] = {0x00};

  aci_hal_read_config_data(CONFIG_DATA_PUBADDR_OFFSET, &Pb_Addr_Len, &Pb_Addr[0]);
  snprintf(source_id_string, COMPLETE_LOCAL_NAME_LENGTH+1, "PBP_WBA_%02X%02X", Pb_Addr[1], Pb_Addr[0]);
  MEMCPY(&a_additional_adv_data[2], source_id_string, COMPLETE_LOCAL_NAME_LENGTH);

  snprintf(broadcast_name_string, BROADCAST_NAME_LENGTH+1, "%s", aPBPAPP_BroadcastName);
  UTIL_LCD_DisplayStringAt(0, 5+12+2, (uint8_t *) broadcast_name_string, CENTER_MODE);

  snprintf(language_string, 10, "%s | %s", LANGUAGE_1, LANGUAGE_2);
  UTIL_LCD_DisplayStringAt(0, 5+12+2+2+12, (uint8_t *) language_string, CENTER_MODE);

  pbp_audio_start_params.pBroadcastAudioStartParams = &cap_audio_start_params;
  pbp_audio_start_params.StandardQuality = 0;
  pbp_audio_start_params.HighQuality = 0;
  pbp_audio_start_params.pAdvMetadata = 0;
  pbp_audio_start_params.AdvMetadataLen = 0;
  pbp_audio_start_params.pBroadcastName = &aPBPAPP_BroadcastName[0];
  pbp_audio_start_params.BroadcastNameLen = BROADCAST_NAME_LENGTH;
  pbp_audio_start_params.Appearance = APPEARANCE;

  cap_audio_start_params.pBaseGroup = &PBPAPP_Context.base_group;
  cap_audio_start_params.BigHandle = 0;

  /* Generate Random Broadcast ID */
  HW_RNG_Get(1, &cap_audio_start_params.BroadcastId);
  /* Reduce broadcast id on 3 bytes */
  cap_audio_start_params.BroadcastId &= 0x00FFFFFF;

  cap_audio_start_params.Rtn = PBPAPP_Context.RTN;
  cap_audio_start_params.Phy = 0x02;
  cap_audio_start_params.Packing = BAP_PACKING_SEQUENTIAL;
  cap_audio_start_params.MaxTransportLatency = PBPAPP_Context.max_transport_latency;
  cap_audio_start_params.Encryption = PBPAPP_Context.encryption;
  cap_audio_start_params.pBroadcastCode = &PBPAPP_Context.broadcast_code[0];
  cap_audio_start_params.AdvHandle = 0;
  cap_audio_start_params.pExtendedAdvParams = &extended_adv_params;
  cap_audio_start_params.pPeriodicAdvParams = &periodic_adv_params;
  cap_audio_start_params.pAdditionalAdvData = &a_additional_adv_data[0];
  cap_audio_start_params.AdditionalAdvDataLen = 18;


  if (BROADCAST_SOURCE_BAP_CONFIG%16 == 3 || BROADCAST_SOURCE_BAP_CONFIG%16 == 5)
  {
    pbp_audio_start_params.StandardQuality = 1u;
  }
  else if (BROADCAST_SOURCE_BAP_CONFIG%16 >= 10)
  {
    pbp_audio_start_params.HighQuality = 1u;
  }

  cap_audio_start_params.AdditionalAdvDataLen += PBPAPP_BuildManufacturerAvertisingData(
                                                 &(a_additional_adv_data[cap_audio_start_params.AdditionalAdvDataLen]),
                                                 MANUFACTURER_DATA_LENGTH);

  LOG_INFO_APP("  Start Broadcast Audio\n");
  ret = PBP_PBS_BroadcastAudioStart(&pbp_audio_start_params);

  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : PBP_PBS_BroadcastAudioStart() function, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: PBP_PBS_BroadcastAudioStart() function\n");
  }

  return ret;
}

/**
  * @brief   Stop PBP Source
  */
uint8_t PBPAPP_StopSource(void)
{
  uint8_t ret;

  LOG_INFO_APP("  Stop Broadcast Audio\n");
  ret = PBP_PBS_BroadcastAudioStop(BIG_HANDLE, 1);

  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : PBP_PBS_BroadcastAudioStop() function, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: PBP_PBS_BroadcastAudioStop() function\n");
  }

  return ret;
}

void APP_NotifyRxAudioCplt(uint16_t AudioFrameSize)
{
  uint8_t i;

  if (PBPAPP_Context.bap_role & BAP_ROLE_BROADCAST_SOURCE)
  {
    for (i = 0; i< PBPAPP_Context.current_num_bis; i++)
    {
      CODEC_SendData(PBPAPP_Context.current_BIS_conn_handles[i], 1, &aSrcBuff[0] + AudioFrameSize/2 + i);
    }
  }
}

void APP_NotifyRxAudioHalfCplt(void)
{
  uint8_t i;

  if (PBPAPP_Context.bap_role & BAP_ROLE_BROADCAST_SOURCE)
  {
    for (i = 0; i< PBPAPP_Context.current_num_bis; i++)
    {
      CODEC_SendData(PBPAPP_Context.current_BIS_conn_handles[i], 1, &aSrcBuff[0] + i);
    }
  }
}

void APP_NotifyTxAudioCplt(uint16_t AudioFrameSize)
{
  UNUSED(AudioFrameSize);
}

void APP_NotifyTxAudioHalfCplt(void)
{

}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
/**
  * @brief  Notify CAP Events for App
  * @param  pNotification: pointer on notification information
 */
static void CAP_App_Notification(CAP_Notification_Evt_t *pNotification)
{

  switch (pNotification->EvtOpcode)
  {
    case CAP_AUDIO_CLOCK_REQ_EVT:
      {
        LOG_INFO_APP(">>== CAP_AUDIO_CLOCK_REQ_EVT\n");
        Sampling_Freq_t *freq = (Sampling_Freq_t *)pNotification->pInfo;
        LOG_INFO_APP("     - Sample Frequency Type:   0x%02X\n",*freq);
        LOG_INFO_APP("==>> Audio Clock with Sample Frequency Type 0x%02X Initialization\n",*freq);
        AudioClock_Init(*freq);
      }
      break;

    default:
      break;
  }
}

static uint8_t PBPAPP_Init(CAP_Role_t CAP_Role, BAP_Role_t BAP_Role)
{
  tBleStatus ret = 0;

  /*Clear the CAP Configuration*/
  memset(&PBPAPP_CAP_Config,0,sizeof(PBPAPP_CAP_Config));

  /*Clear the BAP Configuration*/
  memset(&PBPAPP_BAP_Config,0,sizeof(PBPAPP_BAP_Config));

  /*Clear the CCP Configuration*/
  memset(&PBPAPP_CCP_Config,0,sizeof(CCP_Config_t));

  /*Clear the MCP Configuration*/
  memset(&PBPAPP_MCP_Config,0,sizeof(MCP_Config_t));

  /*Clear the VCP Configuration*/
  memset(&PBPAPP_VCP_Config,0,sizeof(VCP_Config_t));

  /*Clear the VCP Configuration*/
  memset(&PBPAPP_MICP_Config,0,sizeof(MICP_Config_t));

  /*Clear the CSIP Configuration*/
  memset(&PBPAPP_CSIP_Config,0,sizeof(CSIP_Config_t));

  PBPAPP_CAP_Config.Role = CAP_Role;
  PBPAPP_CAP_Config.MaxNumLinks = CFG_BLE_NUM_LINK;

