stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_PBP_Source_Multilanguage/STM32_WPAN/App/pbp_app.c
  PBPAPP_CAP_Config.pStartRamAddr = (uint8_t *)&aCAPMemBuffer;
  PBPAPP_CAP_Config.RamSize = CAP_DYN_ALLOC_SIZE;

  PBPAPP_BAP_Config.Role = BAP_Role;

  PBPAPP_BAP_Config.MaxNumBleLinks = CFG_BLE_NUM_LINK;

  /*Isochronous Channels Configuration*/
  PBPAPP_BAP_Config.ISOChnlConfig.MaxNumCIG = 0;
  PBPAPP_BAP_Config.ISOChnlConfig.MaxNumCISPerCIG = 0;
  PBPAPP_BAP_Config.ISOChnlConfig.MaxNumBIG = MAX_NUM_BIG;
  PBPAPP_BAP_Config.ISOChnlConfig.MaxNumBISPerBIG = MAX_NUM_BIS_PER_BIG;
  PBPAPP_BAP_Config.ISOChnlConfig.pStartRamAddr = 0;
  PBPAPP_BAP_Config.ISOChnlConfig.RamSize = 0u;

  /* Initialize the Basic Audio Profile*/
  ret = CAP_Init(&PBPAPP_CAP_Config,
                 &PBPAPP_BAP_Config,
                 &PBPAPP_VCP_Config,
                 &PBPAPP_MICP_Config,
                 &PBPAPP_CCP_Config,
                 &PBPAPP_MCP_Config,
                 &PBPAPP_CSIP_Config);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : CAP_Init() function, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: CAP_Init() function\n");
  }
  if (ret == BLE_STATUS_SUCCESS)
  {

    /*Initialize the Audio Codec (LC3)*/
    CODEC_LC3Config_t lc3_config = {0};
    PBPAPP_Context.bap_role = PBPAPP_BAP_Config.Role;

    /*Register the Audio Task */
    UTIL_SEQ_RegTask( 1<<CFG_TASK_AUDIO_ID, UTIL_SEQ_RFU, BLE_AUDIO_STACK_Task);

    lc3_config.SessionSize = sizeof(aLC3SessionMemBuffer);
    lc3_config.ChannelSize = sizeof(aLC3ChannelMemBuffer);
    lc3_config.StackSize = sizeof(aLC3StackMemBuffer);

    lc3_config.pSessionStart = aLC3SessionMemBuffer;
    lc3_config.pChannelStart = aLC3ChannelMemBuffer;
    lc3_config.pStackStart = aLC3StackMemBuffer;

    CODEC_ManagerInit(sizeof(aCodecPacketsMemory),
                      (uint8_t*)aCodecPacketsMemory,
                      &lc3_config,
                      CODEC_PROC_MARGIN_US,
                      CODEC_RF_SETUP_US,
                      CODEC_MODE_DEFAULT);
  }
  return ret;
}

static void PBPAPP_SetupBASE(void)
{
  uint8_t i;
  uint8_t a_metadata_sub1[9] = {0x03, METADATA_STREAMING_AUDIO_CONTEXTS,
                                STREAMING_AUDIO_CONTEXT & 0xFF,
                                (STREAMING_AUDIO_CONTEXT >> 8) & 0xFF,
                                0x04, METADATA_LANGUAGE,
                                LANGUAGE_1[0], LANGUAGE_1[1], LANGUAGE_1[2]};
  uint8_t a_metadata_sub2[9] = {0x03, METADATA_STREAMING_AUDIO_CONTEXTS,
                                STREAMING_AUDIO_CONTEXT & 0xFF,
                                (STREAMING_AUDIO_CONTEXT >> 8) & 0xFF,
                                0x04, METADATA_LANGUAGE,
                                LANGUAGE_2[0], LANGUAGE_2[1], LANGUAGE_2[2]};

  /* Init Broadcast Source Configuration */
  PBPAPP_Context.audio_driver_config = AUDIO_DRIVER_CONFIG_LINEIN;
  PBPAPP_Context.phy = TARGET_LE_2M_PHY;

  PBPAPP_Context.base_bis[0].BIS_Index = 0x01;
  PBPAPP_Context.base_bis[0].CodecSpecificConfLength = 0x06;
  PBPAPP_Context.base_bis[0].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_bis[0][0]);

  PBPAPP_Context.base_bis[1].BIS_Index = 0x02;
  PBPAPP_Context.base_bis[1].CodecSpecificConfLength = 0x06;
  PBPAPP_Context.base_bis[1].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_bis[1][0]);

  PBPAPP_Context.base_subgroups[0].NumBISes = 1;
  PBPAPP_Context.base_subgroups[0].pBIS = &(PBPAPP_Context.base_bis[0]);
  PBPAPP_Context.base_subgroups[0].CodecID = 0x0000000006; /* LC3 */
  PBPAPP_Context.base_subgroups[0].CodecSpecificConfLength = 0x0D;
  PBPAPP_Context.base_subgroups[0].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_subgroup[0][0]);
  UTIL_MEM_cpy_8(PBPAPP_Context.subgroup_metadata[0], a_metadata_sub1, 9);
  PBPAPP_Context.base_subgroups[0].pMetadata = &PBPAPP_Context.subgroup_metadata[0][0];
  PBPAPP_Context.base_subgroups[0].MetadataLength = 9;

  PBPAPP_Context.base_subgroups[1].NumBISes = 1;
  PBPAPP_Context.base_subgroups[1].pBIS = &(PBPAPP_Context.base_bis[1]);
  PBPAPP_Context.base_subgroups[1].CodecID = 0x0000000006; /* LC3 */
  PBPAPP_Context.base_subgroups[1].CodecSpecificConfLength = 0x0D;
  PBPAPP_Context.base_subgroups[1].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_subgroup[1][0]);
  UTIL_MEM_cpy_8(PBPAPP_Context.subgroup_metadata[1], a_metadata_sub2, 9);
  PBPAPP_Context.base_subgroups[1].pMetadata = &PBPAPP_Context.subgroup_metadata[1][0];
  PBPAPP_Context.base_subgroups[1].MetadataLength = 9;

  PBPAPP_Context.base_group.NumSubgroups = 2;
  PBPAPP_Context.base_group.pSubgroups = &(PBPAPP_Context.base_subgroups[0]);

  PBPAPP_Context.encryption = BAP_BROADCAST_ENCRYPTION;
  PBPAPP_Context.broadcast_code[0] = aPBPAPP_BroadcastCode[0];
  PBPAPP_Context.broadcast_code[1] = aPBPAPP_BroadcastCode[1];
  PBPAPP_Context.broadcast_code[2] = aPBPAPP_BroadcastCode[2];
  PBPAPP_Context.broadcast_code[3] = aPBPAPP_BroadcastCode[3];

  PBPAPP_Context.RTN = 1u;
  uint8_t subgroup1_i = 0;
  uint8_t subgroup2_i = 0;

  PBPAPP_Context.base_group.pSubgroups[0].CodecSpecificConfLength = 0;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup1_i++] = 0x02;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup1_i++] = CODEC_SAMPLING_FREQ;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup1_i++] = aPBPAPP_CodecConf[BROADCAST_SOURCE_BAP_CONFIG%16].Freq;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup1_i++] = 0x02;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup1_i++] = CODEC_FRAME_DURATION;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup1_i++] = aPBPAPP_CodecConf[BROADCAST_SOURCE_BAP_CONFIG%16].FrameDuration;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup1_i++] = 0x03;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup1_i++] = CODEC_OCTETS_PER_CODEC_FRAME;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup1_i++] = (uint8_t) aPBPAPP_CodecConf[BROADCAST_SOURCE_BAP_CONFIG%16].OctetsPerCodecFrame;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup1_i++] = (uint8_t) (aPBPAPP_CodecConf[BROADCAST_SOURCE_BAP_CONFIG%16].OctetsPerCodecFrame >> 8);

  PBPAPP_Context.base_group.pSubgroups[0].CodecSpecificConfLength += 10;

  PBPAPP_Context.base_group.pSubgroups[1].CodecSpecificConfLength = 0;
  PBPAPP_Context.codec_specific_config_subgroup[1][subgroup2_i++] = 0x02;
  PBPAPP_Context.codec_specific_config_subgroup[1][subgroup2_i++] = CODEC_SAMPLING_FREQ;
  PBPAPP_Context.codec_specific_config_subgroup[1][subgroup2_i++] = aPBPAPP_CodecConf[BROADCAST_SOURCE_BAP_CONFIG%16].Freq;
  PBPAPP_Context.codec_specific_config_subgroup[1][subgroup2_i++] = 0x02;
  PBPAPP_Context.codec_specific_config_subgroup[1][subgroup2_i++] = CODEC_FRAME_DURATION;
  PBPAPP_Context.codec_specific_config_subgroup[1][subgroup2_i++] = aPBPAPP_CodecConf[BROADCAST_SOURCE_BAP_CONFIG%16].FrameDuration;
  PBPAPP_Context.codec_specific_config_subgroup[1][subgroup2_i++] = 0x03;
  PBPAPP_Context.codec_specific_config_subgroup[1][subgroup2_i++] = CODEC_OCTETS_PER_CODEC_FRAME;
  PBPAPP_Context.codec_specific_config_subgroup[1][subgroup2_i++] = (uint8_t) aPBPAPP_CodecConf[BROADCAST_SOURCE_BAP_CONFIG%16].OctetsPerCodecFrame;
  PBPAPP_Context.codec_specific_config_subgroup[1][subgroup2_i++] = (uint8_t) (aPBPAPP_CodecConf[BROADCAST_SOURCE_BAP_CONFIG%16].OctetsPerCodecFrame >> 8);

  PBPAPP_Context.base_group.pSubgroups[1].CodecSpecificConfLength += 10;

  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup1_i++] = 0x02;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup1_i++] = CODEC_FRAMES_BLOCKS_PER_SDU;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup1_i++] = 1;

