stm32-hotspot/STM32WBA-Advanced-BLE-Broadcast-Speaker/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_PBP_Source_Multilanguage/STM32_WPAN/App/pbp_app.c
  PBPAPP_Context.base_group.pSubgroups[0].CodecSpecificConfLength += 3;

  PBPAPP_Context.codec_specific_config_subgroup[1][subgroup2_i++] = 0x02;
  PBPAPP_Context.codec_specific_config_subgroup[1][subgroup2_i++] = CODEC_FRAMES_BLOCKS_PER_SDU;
  PBPAPP_Context.codec_specific_config_subgroup[1][subgroup2_i++] = 1;

  PBPAPP_Context.base_group.pSubgroups[1].CodecSpecificConfLength += 3;


  for (i = 0; i < 2; i++)
  {
    uint8_t bis_i = 0;
    /* Take max RTN and transport latency */
    PBPAPP_Context.RTN = MAX(PBPAPP_Context.RTN, aPBPAPP_BroadcastQoSConf[BROADCAST_SOURCE_BAP_CONFIG].RTN);
    PBPAPP_Context.max_transport_latency = MAX( PBPAPP_Context.max_transport_latency,
                                               aPBPAPP_BroadcastQoSConf[BROADCAST_SOURCE_BAP_CONFIG].MaxTpLatency);
    PBPAPP_Context.base_group.PresentationDelay = MAX(PBPAPP_Context.base_group.PresentationDelay,
                                                      aPBPAPP_BroadcastQoSConf[BROADCAST_SOURCE_BAP_CONFIG].PresentationDelay);

    PBPAPP_Context.base_bis[i].CodecSpecificConfLength = 0;

    PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = 0x05;
    PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = CODEC_AUDIO_CHNL_ALLOCATION;
    PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = 0; /* Mono Location */
    PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = 0;
    PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = 0;
    PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = 0;

    PBPAPP_Context.base_bis[i].CodecSpecificConfLength += 6;
  }
}

static void PBPAPP_StartBroadcastAudio(Audio_Role_t role)
{
  if (role == AUDIO_ROLE_SOURCE)
  {
    CODEC_RegisterTriggerClbk(1,0,&start_audio_source);
  }
  else if (role == AUDIO_ROLE_SINK)
  {
    CODEC_RegisterTriggerClbk(1,1,&start_audio_sink);
  }
}

static tBleStatus PBPAPP_BroadcastSetupAudio(Audio_Role_t role)
{
  Sampling_Freq_t sampling_freq;
  Frame_Duration_t frame_duration;
  uint8_t direction = DATA_PATH_INPUT;
  uint32_t controller_delay;
  uint32_t controller_delay_min = 0;
  uint32_t controller_delay_max = 0;
  uint8_t a_codec_id[5] = {0x00,0x00,0x00,0x00,0x00};
  tBleStatus ret;

  LOG_INFO_APP("==>> Start PBPAPP_BroadcastSetupAudio function\n");

  a_codec_id[0] = AUDIO_CODING_FORMAT_LC3;

  sampling_freq = LTV_GetConfiguredSamplingFrequency(
      &PBPAPP_Context.base_group.pSubgroups[0].pCodecSpecificConf[0],
      PBPAPP_Context.base_group.pSubgroups[0].CodecSpecificConfLength);

  frame_duration = LTV_GetConfiguredFrameDuration(
      &PBPAPP_Context.base_group.pSubgroups[0].pCodecSpecificConf[0],
      PBPAPP_Context.base_group.pSubgroups[0].CodecSpecificConfLength);

  if ((sampling_freq != 0) && (frame_duration != 0xFF))
  {
    PBPAPP_StartBroadcastAudio(role);
    MX_AudioInit(role,
                 sampling_freq,
                 frame_duration,
                 NULL,
                 (uint8_t *)aSrcBuff,
                 (AudioDriverConfig)PBPAPP_Context.audio_driver_config);

    /* AUDIO_ROLE_SOURCE */
    direction = DATA_PATH_INPUT;
    CAP_Broadcast_ReadSupportedControllerDelay(PBPAPP_Context.current_num_bis,
                                               DATA_PATH_INPUT,
                                               a_codec_id,
                                               &controller_delay_min,
                                               &controller_delay_max);

    /* at source we don't have to respect a presentation delay */
    if((controller_delay_min <= BROADCAST_CONTROLLER_DELAY) \
      && (controller_delay_max > BROADCAST_CONTROLLER_DELAY))
    {
      controller_delay = BROADCAST_CONTROLLER_DELAY;
    }
    else if (controller_delay_min > BROADCAST_CONTROLLER_DELAY)
    {
      controller_delay = controller_delay_min;
    }
    else /* (info->ControllerDelayMax < BROADCAST_CONTROLLER_DELAY) */
    {
      controller_delay = controller_delay_max;
    }
    LOG_INFO_APP("Controller delay chosen to value %d us\n", controller_delay);


    CODEC_DataPathParam_t param;
    /* sample coded on 16bits */
    param.SampleDepth = 16;

    /* SAI/I2C peripheral driver requests to set decimation to 2 (stereo buffer)*/
    param.Decimation = 2;

    ret = CAP_Broadcast_SetupAudioDataPath(PBPAPP_Context.current_num_bis,
                                            &PBPAPP_Context.current_BIS_conn_handles[0],
                                            direction,
                                            a_codec_id,
                                            controller_delay,
                                            DATA_PATH_CIRCULAR_BUF,
                                            CONFIGURE_DATA_PATH_CONFIG_LEN,
                                            (const uint8_t*) &param);

    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : CAP_Broadcast_SetupAudioDataPath() function, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: CAP_Broadcast_SetupAudioDataPath() function\n");
    }
  }
  else
  {
    LOG_INFO_APP("Sampling Frequency in LTV is invalid\n");
    ret = BLE_STATUS_FAILED;
  }
  LOG_INFO_APP("==>> End PBPAPP_BroadcastSetupAudio function\n");
  return ret;
}


/* Audio Source */
static int32_t start_audio_source(void)
{
  return Start_RxAudio();
}

/* Audio Sink */
static int32_t start_audio_sink(void)
{
  return Start_TxAudio();
}

static uint8_t PBPAPP_BuildManufacturerAvertisingData(uint8_t *pAdvData, uint8_t AdvDataLen)
{
  if (AdvDataLen >= MANUFACTURER_DATA_LENGTH + 1)
  {
    uint8_t bd_addr[6];
    uint8_t length;

    /* Length */
    pAdvData[0] = MANUFACTURER_DATA_LENGTH;

    /* Type: Manufacturer Data */
    pAdvData[1] = 0xFF;

    /* ST Company ID */
    pAdvData[2] = 0x30;
    pAdvData[3] = 0x00;

    /* BlueSTSDK protocol version */
    pAdvData[4] = 0x02;

    /* Board ID: Discovery Kit WBA */
    pAdvData[5] = 0x8C;

    /* Firmware ID: Public Broadcast Source */
    pAdvData[6] = 0x90;

    /* BD Address */
    aci_hal_read_config_data(CONFIG_DATA_PUBADDR_OFFSET, &length, &(bd_addr[0]));
    pAdvData[7] = bd_addr[0];
    pAdvData[8] = bd_addr[1];
    pAdvData[9] = bd_addr[2];
    pAdvData[9] = bd_addr[3];
    pAdvData[10] = bd_addr[4];
    pAdvData[11] = bd_addr[5];

    return MANUFACTURER_DATA_LENGTH + 1;
  }
  else
  {
    /* Advertising Data size insufficient */
    return 0;
  }
}
